Revit 2027 API
UIApplication.MacroUpdated Event
 MacroUpdated.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<MacroUpdatedEventArgs> MacroUpdated
Public Event MacroUpdated As EventHandler(Of MacroUpdatedEventArgs)
public:
 event EventHandler<MacroUpdatedEventArgs^>^ MacroUpdated {
	void add (EventHandler<MacroUpdatedEventArgs^>^ value);
	void remove (EventHandler<MacroUpdatedEventArgs^>^ value);
}
member MacroUpdated : IEvent<EventHandler<MacroUpdatedEventArgs>,
    MacroUpdatedEventArgs>
Value
EventHandler<MacroUpdatedEventArgs>
Remarks
This event is raised after macro modules were updated.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace